lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE3.svd
        <!-- #RST_REG_DSP_CLOCK -->
        <!-- #RST_REG_ETH_CLOCK -->
        <register>
          <name>ETH_CLOCK</name>
          <description>Ethernet and MIL Clock Control</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #ETH_RMASK -->  
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <!-- ETH_CLOCK.ETH_BRG -->
            <field>
              <name>ETH_BRG</name>
              <description>Always set to 0!</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.MIL_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">            
              <name>MIL_BRG</name>
              <description>HCLK freq divider to get MAN_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.PHY_BRG -->
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>PHY_BRG</name>
              <description>HCLK freq divider to get PHY_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <!-- ETH_CLOCK.ETH_CLK_EN -->
            <field>
              <name>ETH_CLK_EN</name>
              <description>Ethernet MAC Clock Enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MAC_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MAC Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MAC Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.MIL_CLK_EN -->
            <field>
              <name>MIL_CLK_EN</name>
              <description>MIL-STD CLOCK Enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MIL_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MIL Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MIL Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.SLEEP -->
            <field>
              <name>SLEEP</name>
              <description>Switch to Sleep mode</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__SLEEP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Normal Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GoSLEEP</name>
                  <description>Go to SLEEP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.PHY_CLK_EN -->
            <field>
              <name>PHY_CLK_EN</name>
              <description>Ethernet PHY CLOCK Enable</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__PHY_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MIL Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MIL Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK.PHY_CLK_SEL -->
            <field>
              <name>PHY_CLK_SEL</name>
              <description>Ethernet PHY CLOCK Select</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__PHY_SEL_</headerEnumName>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>PHY Clock from HSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>PHY Clock from HSE</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLCPUo</name>
                  <description>PHY Clock from PLLCPUo</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE2</name>
                  <description>PHY Clock from HSE2</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #ETH2_CLK_VE3 -->
            <field>
              <name>ETH2_CLK_EN</name>
              <description>Ethernet2 MAC Clock Enable</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__ETH__MAC2_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>MAC Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>MAC Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- ETH_CLOCK fields end-->
          </fields>
        </register>
        <!-- #RST_REG_SSP2 -->
        <!-- #RST_REG_PER2 -->
        <register>
          <name>PER2_CLOCK</name>
          <description>Peripherials Clock Control 2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>AUC_CLK_EN</name>
              <description>AudioCodec Clock Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>LED_CLK_EN</name>
              <description>LED Clock Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>KEY_CLK_EN</name>
              <description>Keyboard Clock Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTG_CLK_EN</name>
              <description>PORT_G Clock Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>UART3_CLK_EN</name>
              <description>UART3 Clock Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>UART4_CLK_EN</name>
              <description>UART4 Clock Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>SSP4_CLK_EN</name>
              <description>SSP4 Clock Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTH_CLK_EN</name>
              <description>PORT_H Clock Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.PER_CLOCK.USB_CLK_EN">
              <name>PORTI_CLK_EN</name>
              <description>PORT_I Clock Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <!-- PER2_CLOCK fields end-->
          </fields>
        </register>
        <!-- #RST_REG_DSP_CTRL -->
        <!-- #RST_REG_UARTSSP -->
        <register>
          <name>UART_SSP_CLOCK</name>
          <description>UART and SSP Clock Control</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07070707</resetMask>
          <fields>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART3_BRG</name>
              <description>HCLK freq divider to get UART3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>           
            </field>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>UART4_BRG</name>
              <description>HCLK freq divider to get UART4_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field derivedFrom="MDR_RST_CLOCK.TIM_CLOCK.TIM1_BRG">
              <name>SSP3_BRG</name>
              <description>HCLK freq divider to get SSP3_CLOCK, [/1, /2, /4 .. /128]</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3_CLK_EN</name>
              <description>UART3_CLOCK enable</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__UART3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART4_CLK_EN</name>
              <description>UART4_CLOCK enable</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__UART4_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>UART4 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>UART4 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSP3_CLK_EN</name>
              <description>SSP3_CLOCK enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RST__UARTSSP__SSP3_CLK_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>SSP3 Clock Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>SSP3 Clock Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- UART_SSP_CLOCK fields end-->
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #DMA -->
    <!-- DMA -->
    <peripheral>
      <name>MDR_DMA</name>
      <version>1.0</version>
      <description>DMA Controler</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40028000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!-- STATUS -->
        <register>
          <name>STATUS</name>
          <description>Status register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0xF01F0F01</resetMask>
          <fields>
            <field>
              <name>Enable</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>State</name>
              <description>Active Operation</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Idle</name><description>Idle state</description>                         <value>0</value></enumeratedValue>
                <enumeratedValue><name>RD_Ctrl</name><description>Reading channel controller data</description> <value>1</value></enumeratedValue>
                <enumeratedValue><name>RD_pSrc</name><description>Reading source data end pointer</description> <value>2</value></enumeratedValue>
                <enumeratedValue><name>RD_pDest</name><description>Reading destination data end pointer</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>RD_Data</name><description>Reading source data</description>             <value>4</value></enumeratedValue>
                <enumeratedValue><name>WR_Data</name><description>writing destination data</description>        <value>5</value></enumeratedValue>
                <enumeratedValue><name>Wait_Clr</name><description>Waiting for DMA request to clear</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>WR_Ctrl</name><description>Writing channel controller data</description> <value>7</value></enumeratedValue>
                <enumeratedValue><name>Stalled</name><description>Stalled transfer</description>                <value>8</value></enumeratedValue>
                <enumeratedValue><name>Done</name><description>Done transfer</description>                      <value>9</value></enumeratedValue>
                <enumeratedValue><name>ScatGath</name><description>scatter-gather transition</description>      <value>10</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Chnls_minus1</name>
              <description>Channels count</description>
              <bitRange>[20:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>1_channels</name><description>Channels Count</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>2_channels</name><description>Channels Count</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>3_channels</name><description>Channels Count</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>4_channels</name><description>Channels Count</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>5_channels</name><description>Channels Count</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>6_channels</name><description>Channels Count</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>7_channels</name><description>Channels Count</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>8_channels</name><description>Channels Count</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>9_channels</name><description>Channels Count</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>10_channels</name><description>Channels Count</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>11_channels</name><description>Channels Count</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>12_channels</name><description>Channels Count</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>13_channels</name><description>Channels Count</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>14_channels</name><description>Channels Count</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>15_channels</name><description>Channels Count</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>16_channels</name><description>Channels Count</description><value>15</value></enumeratedValue>
                <enumeratedValue><name>17_channels</name><description>Channels Count</description><value>16</value></enumeratedValue>
                <enumeratedValue><name>18_channels</name><description>Channels Count</description><value>17</value></enumeratedValue>
                <enumeratedValue><name>19_channels</name><description>Channels Count</description><value>18</value></enumeratedValue>
                <enumeratedValue><name>20_channels</name><description>Channels Count</description><value>19</value></enumeratedValue>
                <enumeratedValue><name>21_channels</name><description>Channels Count</description><value>20</value></enumeratedValue>
                <enumeratedValue><name>22_channels</name><description>Channels Count</description><value>21</value></enumeratedValue>
                <enumeratedValue><name>23_channels</name><description>Channels Count</description><value>22</value></enumeratedValue>
                <enumeratedValue><name>24_channels</name><description>Channels Count</description><value>23</value></enumeratedValue>
                <enumeratedValue><name>25_channels</name><description>Channels Count</description><value>24</value></enumeratedValue>
                <enumeratedValue><name>26_channels</name><description>Channels Count</description><value>25</value></enumeratedValue>
                <enumeratedValue><name>27_channels</name><description>Channels Count</description><value>26</value></enumeratedValue>
                <enumeratedValue><name>28_channels</name><description>Channels Count</description><value>27</value></enumeratedValue>
                <enumeratedValue><name>29_channels</name><description>Channels Count</description><value>28</value></enumeratedValue>
                <enumeratedValue><name>30_channels</name><description>Channels Count</description><value>29</value></enumeratedValue>
                <enumeratedValue><name>31_channels</name><description>Channels Count</description><value>30</value></enumeratedValue>
                <enumeratedValue><name>32_channels</name><description>Channels Count</description><value>31</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>test_status</name>
              <description>Test logic availability</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Unavailable</name><description>Test logic unavailable</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Available</name><description>Test logic available</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>  
        </register>
        <!-- CFG -->
        <register>
          <name>CFG</name>
          <description>Config register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0000000</resetValue>
          <resetMask>0x000000E1</resetMask>
          <fields>
            <field>
              <name>Enable</name>
              <description>Enable block</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Disabled</name><description>Block inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Enabled</name><description>Block active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Privileged</name>
              <description>Privileged AHB bus priority</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="Privileged">
              <name>Bufferable</name>
              <description>Bufferable AHB bus priority</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="Privileged">
              <name>Cachable</name>
              <description>Cachable AHB bus priority</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>  
        </register>
