lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE3.svd
        <!-- REG_0E -->
        <register>
          <name>REG_0E</name>
          <description>REG_OE Control register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #BKP_RESMSK -->
          <resetMask>0x0000BF7F</resetMask>
          <fields>
            <!--LOW-->
            <field>
              <name>LOW</name>
              <description>DUcc Freq control</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__LOW_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>CPU Clock less then 10MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>CPU Clock less then 200KHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>CPU Clock less then 500KHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>CPU Clock less then 1MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Generators Off</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>CPU Clock less then 40MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>CPU Clock less then 80MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>CPU Clock above 10MHz</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--SelectRI-->
            <field>
              <name>SelectRI</name>
              <description>DUcc extra I, should be equals to LOW field!</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__SelRI_</headerEnumName>
                <enumeratedValue>
                  <name>10MHz</name>
                  <description>Additional I ~ 300uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>200KHz</name>
                  <description>Additional I ~ 6.6uA</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500KHz</name>
                  <description>Additional I ~ 20A</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>Additional I ~ 80uA</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GensOffz</name>
                  <description>Additional I ~ 2uA</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40MHz</name>
                  <description>Additional I ~ 900uA</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>80MHz</name>
                  <description>Additional I ~ 4.4mA</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>above_80MHz</name>
                  <description>Additional I ~ 19mA</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_ALONE -->
            <field>
              <name>StandAlone</name>
              <description>Switch to StandAlone mode</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__StandAlone_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Microcontroller mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Switch to interface IC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_JTAGA -->
            <!-- #BKP_JTAGB -->
            <!--Trim dDUcc-->
            <field>
              <name>Trim_dDUcc</name>
              <description>Ducc adjust voltages</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__dDUcc_</headerEnumName>
                <enumeratedValue>
                  <name>+0.1</name>
                  <description>DUcc += 0.1 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.06</name>
                  <description>DUcc += 0.06 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.04</name>
                  <description>DUcc += 0.04 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>+0.01</name>
                  <description>DUcc += 0.01 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.01</name>
                  <description>DUcc -= 0.01 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.04</name>
                  <description>DUcc -= 0.04 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.6</name>
                  <description>DUcc -= 0.06 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>-0.1</name>
                  <description>DUcc -= 0.1 V</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--FPOR-->
            <field>
              <name>FPOR</name>
              <description>Power Reset Flag</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__FPOR_</headerEnumName>
                <enumeratedValue>
                  <name>Low</name>
                  <description>No Bootloader</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Bootloader completed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_TRIM_DU -->
            <field>
              <name>Trim_DUcc</name>
              <description>Select DUcc voltage</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__DUcc_</headerEnumName>
                <enumeratedValue>
                  <name>1.8</name>
                  <description>DUcc = 1.8 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.6</name>
                  <description>DUcc = 1.6 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1.4</name>
                  <description>DUcc = 1.4 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Forbiden</name>
                  <description>Forbiden value</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!-- #BKP_COVDET -->
            <!-- #BKP_MODE -->
            <!-- #BKP_LimI -->
            <field>
              <name>I_LimEn</name>
              <description>Enable I 150mA protection</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_BKP_0E__Ilim_</headerEnumName>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
