lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE3.svd
        <!-- REG_0F -->
        <register>
          <name>REG_0F</name>
          <description>REG_OF Control register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFBFFF</resetMask>
          <fields>
            <!--LSE_ON-->
            <field>
              <name>LSE_ON</name>
              <description>LSE generator enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RTC__LSE_ON_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Disable state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Enable state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--LSE_BYP-->
            <field>
              <name>LSE_BYP</name>
              <description>LSE generator </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <headerEnumName>MDR_RTC__LSE_BYP_</headerEnumName>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Use for external resonator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Use for external generator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--RTC_SEL-->
            <field>
              <name>RTC_SEL</name>
              <description>Select Clock for RTC</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>RTC use LSI clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>RTC use LSE clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSIRTC</name>
                  <description>RTC use HSIRTC clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSERTC</name>
                  <description>RTC use HSERTC clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>                            
            </field>
            <!--RTC_EN-->
            <field derivedFrom="LSE_ON">
              <name>RTC_EN</name>
              <description>RTC enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!--RTC_CAL-->
            <field>
              <name>RTC_CAL</name>
              <description>RTC calibration</description>
              <bitRange>[12:5]</bitRange>              
            </field>
            <!--RTC_CAL-->
            <field>
              <name>LSE_RDY</name>
              <description>LSE frequency ready</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>No frequency or unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Frequency ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field> 
            <!--LSI_ON-->
            <field derivedFrom="LSE_ON">
              <name>LSI_ON</name>
              <description>LSI generator enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <!--LSI_TRIM-->
            <field>
              <name>LSI_TRIM</name>
              <description>LSI frequency adjust</description>
              <bitRange>[20:16]</bitRange>              
              <enumeratedValues>
                <enumeratedValue> 
                  <name>69KHz</name>
                  <description>LSI frequency tuner</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>65KHz</name><value>1</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>60KHz</name><value>2</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>58KHz</name><value>3</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>52KHz</name><value>4</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>50KHz</name><value>5</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>49KHz</name><value>6</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>45KHz</name><value>7</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>44KHz</name><value>8</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>42KHz</name><value>9</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>40KHz</name><value>10</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>39KHz</name><value>11</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>37KHz</name><value>12</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>36KHz</name><value>13</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>35KHz</name><value>14</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>33KHz</name><value>15</value></enumeratedValue>
                <enumeratedValue derivedFrom="69KHz"><name>32KHz</name><value>16</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <!--LSI_RDY-->
            <field derivedFrom="LSE_RDY">
              <name>LSI_RDY</name>
              <description>LSI frequency ready</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <!--HSI_ON-->
            <field derivedFrom="LSE_ON">
              <name>HSI_ON</name>
              <description>HSI generator enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <!--HSI_RDY-->
            <field derivedFrom="LSE_RDY">
              <name>HSI_RDY</name>
              <description>HSI frequency ready</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <!--HSI_TRIM-->
            <field>
              <name>HSI_TRIM</name>
              <description>HSI frequency adjust</description>
              <bitRange>[29:24]</bitRange>              
            </field>
            <!--Standby-->
            <field>
              <name>Standby</name>
              <description>Standby sleep mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Normal mode, DUcc is On</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Standby mode, DUcc is Off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--RTC_RESET-->
            <field>
              <name>RTC_RESET</name>
              <description>Reset RTC bit</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>RTC active state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>RTC in Reset state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- RTC_CNT -->
        <register>
          <name>RTC_CNT</name>
          <description>Count periods of PRL</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- RTC_DIV -->
        <register>
          <name>RTC_DIV</name>
          <description>Counts RTC Clock to get PRL value</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>RTC DIV value </description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_PRL -->
        <register>
          <name>RTC_PRL</name>
          <description>Period value for DIV counter</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>RTC PRL value </description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_ALRM -->
        <register>
          <name>RTC_ALRM</name>
          <description>Event value for CNT counter</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <!--Value-->
            <field>
              <name>Value</name>
              <description>Alarm value of CNT</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- RTC_CS -->
        <register>
          <name>RTC_CS</name>
          <description>RTC Control and Status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <!--OWF-->
            <field>
              <name>OWF</name>
              <description>CNT Overflow flag, clear by set 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>No Event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Event</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <!--SECF-->
            <field derivedFrom="OWF">
              <name>SECF</name>
              <description>DIV == PRL Event, clear by set 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <!--ALRF-->
            <field derivedFrom="OWF">
              <name>ALRF</name>
              <description>CNT == ALRM Event, clear by set 1</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <!--OWF_IE-->
            <field derivedFrom="OWF">
              <name>OWF_IE</name>
              <description>Enable IRQ by OWF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <!--SECF_IE-->
            <field derivedFrom="OWF">
              <name>SECF_IE</name>
              <description>Enable IRQ by SECF</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <!--ALRF_IE-->
            <field derivedFrom="OWF">
              <name>ALRF_IE</name>
              <description>Enable IRQ by ALRF</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <!--WEC-->
            <field>
              <name>WEC</name>
              <description>RTC Busy flag</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Registers available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>Registers unavailable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!-- Registers end-->
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #EBC -->

    <!-- #AUC -->
    <!-- #LED -->
    <!-- #KEY -->

    <!-- #ETHERNETs -->

    <!-- #CANs -->
    <!-- #UARTs -->
    <!--UART1-->
    <peripheral>
      <name>MDR_UART1</name>
      <version>1.0</version>
      <description>UART Control</description>
      <groupName>UART</groupName>
      <!-- #UART1_ADDR -->
      <baseAddress>0x40030000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <size>0x84</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--DR-->
        <register>
          <name>DR</name>
          <description>Data Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data FIFO access</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <!--RSR_ECR-->
        <register>
          <name>RSR_ECR</name>
          <description>Receive Status and Error Clear Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>FE</name>
              <description>Stop Bit Error</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue><name>Ok</name><description>No Error</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ERROR</name><description>Error is active</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="FE">
              <name>PE</name>
              <description>Parity Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>BE</name>
              <description>Break Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field derivedFrom="FE">
              <name>OE</name>
              <description>Overrun FIFO_RX</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <!--FR-->
        <register>
          <name>FR</name>
          <description>Flag Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CTS</name>
              <description>Modem Clear To Send</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>Modem line is High</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Active</name><description>Modem line is Low</description><value>1</value></enumeratedValue>
              </enumeratedValues>          
            </field>
            <field derivedFrom="CTS">
              <name>DSR</name>
              <description>Modem Data Set Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>DCD</name>
              <description>Modem Data Carrier Detect</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>Transmitting data</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Inactive</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Active</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Empty</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Empty</name><description>FIFO Empty</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFF</name>
              <description>FIFO_TX Full Status</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Inactive</name><description>FIFO not Full</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Full</name><description>FIFO Full</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="TXFF">
              <name>RXFF</name>
              <description>FIFO_RX Full Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field derivedFrom="RXFE">
              <name>TXFE</name>
              <description>FIFO_RX Empty status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field derivedFrom="CTS">
              <name>RI</name>
              <description>Modem Ring Indicator</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <!--ILPR-->
        <register>
          <name>ILPR</name>
          <description>IrDA Low-Power Counter</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DVSR</name>
              <description>Div of SampleRate</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--IBRD-->
        <register>
          <name>IBRD</name>
          <description>Integer BaudRate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>Baud_DivInt</name>
              <description>Integer part of Rate divisor</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
