lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE3.svd
      </registers>
      <!-- peripheral end-->
    </peripheral>
    <!-- #MDR_UART2 -->
    <peripheral derivedFrom="MDR_UART1">
      <name>MDR_UART2</name>
      <baseAddress>0x40038000</baseAddress>
    </peripheral>
    <!-- #MDR_UART3 -->
    <peripheral derivedFrom="MDR_UART1">
      <name>MDR_UART3</name>
      <baseAddress>0x40120000</baseAddress>
    </peripheral>
    <!-- #MDR_UART4 -->
    <peripheral derivedFrom="MDR_UART1">
      <name>MDR_UART4</name>
      <baseAddress>0x40128000</baseAddress>
    </peripheral>
    <!-- #TIMERs -->
    <!--TIMER1-->
    <peripheral>
      <name>MDR_TIMER1</name>
      <version>1.0</version>
      <description>TIMER Control</description>
      <groupName>TIMER</groupName>
      <!-- #TIMER1_ADDR -->
      <baseAddress>0x40070000</baseAddress>
      <size>32</size>
      <access>read-write</access>
      <addressBlock>
        <offset>0</offset>
        <!-- #TIMER_SIZE -->
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <!--CNT-->
        <register>
          <name>CNT</name>
          <description>Counter register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #TIMER_MASK -->
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Counter Value</description>
              <!-- #TIMER_RANGE -->
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--PSG-->
        <register>
          <name>PSG</name>
          <description>Presample Gain</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Inc CNT by PSG clocks of TIM_CLOCK</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--ARR-->
        <register>
          <name>ARR</name>
          <description>Counter Period</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #TIMER_MASK -->
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Counter Value</description>
              <!-- #TIMER_RANGE -->
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!--CNTRL-->
        <register>
          <name>CNTRL</name>
          <description>Timer Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CNT_EN</name>
              <description>Timer Enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARRB_EN</name>
              <description>ARR update mode</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Immediately</name><description>Immediately update</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>OnCompleted</name><description>Update ARR when active period of CNT finished</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>Can write to CNT, ARR, PSG</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Ready</name><description>Ready to write</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>BUSY</name><description>Writing not completed</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Count Direction</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>UP</name><description>CNT counts from 0 to ARR</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>DOWN</name><description>CNT counts from ARR to 0</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDTS</name>
              <description>Select Data Sampling frequency</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>TIM_CLK_div1</name><description>TIM_Clock to FDTS scale</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>TIM_CLK_div2</name><description>TIM_Clock to FDTS scale</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>TIM_CLK_div4</name><description>TIM_Clock to FDTS scale</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>TIM_CLK_div8</name><description>TIM_Clock to FDTS scale</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Counting mode</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>DIR_TIM_CLK</name><description>Count TIM_Clock pulses with DIR direction</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>UpDown_TIM_CLK</name><description>Count TIM_Clock pulses UP and Down</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>DIR_ExtEvents</name><description>Count External Events with DIR direction</description><value>2</value></enumeratedValue>
                <!-- #TIMER_UpDown_Ext_nVE1 -->
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT_SEL</name>
              <description>Events for counting</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Rise_TIM_CLK</name><description>CNT counts from 0 to ARR</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>CNT_eq_ARR_TIM1</name><description>CNT gets ARR in Timer1</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>CNT_eq_ARR_TIM2</name><description>CNT gets ARR in Timer2</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>CNT_eq_ARR_TIM3</name><description>CNT gets ARR in Timer3</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Event_Ch1</name><description>Event in Channel1</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Event_Ch2</name><description>Event in Channel2</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Event_Ch3</name><description>Event in Channel3</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Event_Ch4</name><description>Event in Channel4</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>Rise_ETR</name><description>Rise front in ETR pin</description><value>8</value></enumeratedValue>
                <!-- #TIMER_Event_9_VE1 -->
                <enumeratedValue><name>Fall_ETR</name><description>Fall front in ETR pin</description><value>9</value></enumeratedValue>
                <!-- #TIMER_Event_10_VE1 -->            
                <enumeratedValue><name>CNT_eq_ARR_TIM4</name><description>CNT gets ARR in Timer4</description><value>10</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
