lamer0k/CortexLib/Tools/RegistersGenerator/Milandr/MDR1986VE3.svd
        <!--CCR1-->
        <register>
          <name>CCR1</name>
          <description>CNT Compare Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!-- #TIMER_MASK -->
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Value</name>
              <description>Captured or PWM Value</description>
              <!-- #TIMER_RANGE -->
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <!--CCR2-->
        <register derivedFrom="CCR1">
          <name>CCR2</name>
          <addressOffset>0x00000014</addressOffset>
        </register>
        <!--CCR3-->
        <register derivedFrom="CCR1">
          <name>CCR3</name>
          <addressOffset>0x00000018</addressOffset>
        </register>
          <!--CCR4-->
        <register derivedFrom="CCR1">
          <name>CCR4</name>
          <addressOffset>0x0000001C</addressOffset>
        </register>
        <!--CH1_CNTRL-->
        <register>
          <name>CH1_CNTRL</name>
          <description>Capture and PWM Channel Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>CHFLTR</name>
              <description>Front hold to set Event</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>TIM_CLK</name><description>Filter Value</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>2_TIM_CLK</name><description>Filter Value</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>4_TIM_CLK</name><description>Filter Value</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>8_TIM_CLK</name><description>Filter Value</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>6_FDTS_div2</name><description>Filter Value</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>8_FDTS_div2</name><description>Filter Value</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>6_FDTS_div4</name><description>Filter Value</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>8_FDTS_div4</name><description>Filter Value</description><value>7</value></enumeratedValue>
                <enumeratedValue><name>6_FDTS_div8</name><description>Filter Value</description><value>8</value></enumeratedValue>
                <enumeratedValue><name>8_FDTS_div8</name><description>Filter Value</description><value>9</value></enumeratedValue>
                <enumeratedValue><name>5_FDTS_div16</name><description>Filter Value</description><value>10</value></enumeratedValue>
                <enumeratedValue><name>6_FDTS_div16</name><description>Filter Value</description><value>11</value></enumeratedValue>
                <enumeratedValue><name>8_FDTS_div16</name><description>Filter Value</description><value>12</value></enumeratedValue>
                <enumeratedValue><name>5_FDTS_div32</name><description>Filter Value</description><value>13</value></enumeratedValue>
                <enumeratedValue><name>6_FDTS_div32</name><description>Filter Value</description><value>14</value></enumeratedValue>
                <enumeratedValue><name>8_FDTS_div32</name><description>Filter Value</description><value>15</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL</name>
              <description>Event to capture in CCR</description>
              <bitRange>[5:4]</bitRange>          
              <enumeratedValues>
                <enumeratedValue><name>Rise_Pin</name><description>Capture Event Select</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Fall_Pin</name><description>Capture Event Select</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Rise_NextCH</name><description>Capture Event Select</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Rise_NextNextCH</name><description>Capture Event Select</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHPSC</name>
              <description>Capture event decimation</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>EveryEvent</name><description>Pass event for capture</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Events_div2</name><description>Pass event for capture</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Events_div4</name><description>Pass event for capture</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Events_div8</name><description>Pass event for capture</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCCE</name>
              <description>ETR pin Enable</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Off</name><description>Disabled</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>On</name><description>Enabled</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCCM</name>
              <description>PWM Generate modes</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Ref_0</name><description>Ref signal for output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>Ref_1_eqCCRx</name><description>Ref signal for output</description><value>1</value></enumeratedValue>
                <enumeratedValue><name>Ref_0_eqCCRx</name><description>Ref signal for output</description><value>2</value></enumeratedValue>
                <enumeratedValue><name>Ref_sw_eqCCRx</name><description>Ref signal for output</description><value>3</value></enumeratedValue>
                <enumeratedValue><name>Ref0</name><description>Ref signal for output</description><value>4</value></enumeratedValue>
                <enumeratedValue><name>Ref_1</name><description>Ref signal for output</description><value>5</value></enumeratedValue>
                <enumeratedValue><name>Ref_nDir_inCCRs</name><description>Ref signal for output</description><value>6</value></enumeratedValue>
                <enumeratedValue><name>Ref_Dir_inCCRs</name><description>Ref signal for output</description><value>7</value></enumeratedValue>            
              </enumeratedValues>
            </field>
            <field derivedFrom="OCCE">
              <name>BRKEN</name>
              <description>Clear Ref by BRK</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field derivedFrom="OCCE">
              <name>ETREN</name>
              <description>Clear Ref by BRK</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>Can write to CCRx</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>Ready</name><description>Ready to write</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>BUSY</name><description>Writing not completed</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP_nPWM</name>
              <description>CAP or PWM Mode</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <enumeratedValue><name>PWM</name><description>PWM output</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>CAPTURE</name><description>Capture input signal</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <!--CH2_CNTRL-->
        <register  derivedFrom="CH1_CNTRL">
          <name>CH2_CNTRL</name>
          <addressOffset>0x00000024</addressOffset>
        </register>
